zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA174VLL-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA174VLL/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA344VLH-pinctrl.h with this part's differences applied
 * below (10 removed, 0 changed,
 * 153 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 796e143b40c94355
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA174VLL_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA174VLL_WRAPPER_

#include "MCXA344VLH-pinctrl.h"

/* Signals not present on this part */
#undef CMP2_IN0_P2_4
#undef CMP2_IN3_P1_2
#undef CMP2_INN4_P2_2
#undef CMP2_INP4_P2_6
#undef OPAMP1_INN_P2_17
#undef OPAMP1_INP_P2_16
#undef OPAMP1_OUT_P2_19
#undef OPAMP2_INN_P2_1
#undef OPAMP2_INP_P2_0
#undef OPAMP2_OUT_P2_6

/* Signals specific to this part */
#define ADC0_A10_P0_20 A15X_MUX('0',20,0)
#define ADC0_A11_P0_21 A15X_MUX('0',21,0)
#define ADC0_A12_P0_22 A15X_MUX('0',22,0)
#define ADC0_A13_P0_23 A15X_MUX('0',23,0)
#define ADC0_A8_P0_18 A15X_MUX('0',18,0)
#define ADC0_A9_P0_19 A15X_MUX('0',19,0)
#define ADC1_A12_P1_14 A15X_MUX('1',14,0)
#define ADC1_A13_P1_15 A15X_MUX('1',15,0)
#define CLKOUT_P4_2 A15X_MUX('4',2,1)
#define CMP0_OUT_P0_18 A15X_MUX('0',18,8)
#define CMP1_OUT_P0_19 A15X_MUX('0',19,8)
#define CT0_MAT0_P0_22 A15X_MUX('0',22,5)
#define CT0_MAT1_P0_23 A15X_MUX('0',23,5)
#define CT0_MAT2_P0_18 A15X_MUX('0',18,4)
#define CT0_MAT3_P0_19 A15X_MUX('0',19,4)
#define CT2_MAT0_P2_20 A15X_MUX('2',20,4)
#define CT2_MAT0_P3_18 A15X_MUX('3',18,4)
#define CT2_MAT1_P2_21 A15X_MUX('2',21,4)
#define CT2_MAT1_P3_19 A15X_MUX('3',19,4)
#define CT2_MAT2_P3_20 A15X_MUX('3',20,4)
#define CT2_MAT3_P2_23 A15X_MUX('2',23,4)
#define CT2_MAT3_P3_21 A15X_MUX('3',21,4)
#define CT_INP0_P0_20 A15X_MUX('0',20,4)
#define CT_INP10_P2_26 A15X_MUX('2',26,4)
#define CT_INP10_P3_22 A15X_MUX('3',22,4)
#define CT_INP1_P0_21 A15X_MUX('0',21,4)
#define CT_INP2_P0_14 A15X_MUX('0',14,4)
#define CT_INP2_P0_22 A15X_MUX('0',22,4)
#define CT_INP3_P0_15 A15X_MUX('0',15,4)
#define CT_INP3_P0_23 A15X_MUX('0',23,4)
#define CT_INP6_P4_6 A15X_MUX('4',6,4)
#define CT_INP7_P4_7 A15X_MUX('4',7,4)
#define CT_INP8_P2_24 A15X_MUX('2',24,4)
#define CT_INP8_P3_16 A15X_MUX('3',16,4)
#define CT_INP9_P2_25 A15X_MUX('2',25,4)
#define CT_INP9_P3_17 A15X_MUX('3',17,4)
#define LPI2C0_SCLS_P0_18 A15X_MUX('0',18,2)
#define LPI2C0_SDAS_P0_19 A15X_MUX('0',19,2)
#define LPI2C1_SCLS_P1_14 A15X_MUX('1',14,2)
#define LPI2C1_SDAS_P1_15 A15X_MUX('1',15,2)
#define LPSPI1_PCS2_P2_20 A15X_MUX('2',20,2)
#define LPSPI1_PCS3_P2_21 A15X_MUX('2',21,2)
#define LPUART0_CTS_B_P0_23 A15X_MUX('0',23,3)
#define LPUART0_RTS_B_P0_22 A15X_MUX('0',22,3)
#define LPUART0_RXD_P0_20 A15X_MUX('0',20,3)
#define LPUART0_TXD_P0_21 A15X_MUX('0',21,3)
#define LPUART1_RTS_B_P3_22 A15X_MUX('3',22,3)
#define LPUART1_RXD_P3_20 A15X_MUX('3',20,3)
#define LPUART1_TXD_P3_21 A15X_MUX('3',21,3)
#define LPUART2_CTS_B_P1_15 A15X_MUX('1',15,3)
#define LPUART2_RTS_B_P1_14 A15X_MUX('1',14,3)
#define LPUART2_RXD_P2_11 A15X_MUX('2',11,3)
#define LPUART2_TXD_P2_10 A15X_MUX('2',10,3)
#define LPUART3_CTS_B_P4_6 A15X_MUX('4',6,3)
#define LPUART3_RTS_B_P4_7 A15X_MUX('4',7,3)
#define LPUART3_RXD_P4_2 A15X_MUX('4',2,3)
#define LPUART3_TXD_P4_5 A15X_MUX('4',5,3)
#define P0_14 A15X_MUX('0',14,0)
#define P0_15 A15X_MUX('0',15,0)
#define P0_18 A15X_MUX('0',18,0)
#define P0_19 A15X_MUX('0',19,0)
#define P0_20 A15X_MUX('0',20,0)
#define P0_21 A15X_MUX('0',21,0)
#define P0_22 A15X_MUX('0',22,0)
#define P0_23 A15X_MUX('0',23,0)
#define P1_14 A15X_MUX('1',14,0)
#define P1_15 A15X_MUX('1',15,0)
#define P2_10 A15X_MUX('2',10,0)
#define P2_11 A15X_MUX('2',11,0)
#define P2_20 A15X_MUX('2',20,0)
#define P2_21 A15X_MUX('2',21,0)
#define P2_23 A15X_MUX('2',23,0)
#define P2_24 A15X_MUX('2',24,0)
#define P2_25 A15X_MUX('2',25,0)
#define P2_26 A15X_MUX('2',26,0)
#define P3_16 A15X_MUX('3',16,0)
#define P3_17 A15X_MUX('3',17,0)
#define P3_18 A15X_MUX('3',18,0)
#define P3_19 A15X_MUX('3',19,0)
#define P3_20 A15X_MUX('3',20,0)
#define P3_21 A15X_MUX('3',21,0)
#define P3_22 A15X_MUX('3',22,0)
#define P4_2 A15X_MUX('4',2,0)
#define P4_3 A15X_MUX('4',3,0)
#define P4_4 A15X_MUX('4',4,0)
#define P4_5 A15X_MUX('4',5,0)
#define P4_6 A15X_MUX('4',6,0)
#define P4_7 A15X_MUX('4',7,0)
#define PWM0_A0_P4_6 A15X_MUX('4',6,5)
#define PWM0_A1_P4_4 A15X_MUX('4',4,5)
#define PWM0_A2_P4_2 A15X_MUX('4',2,5)
#define PWM0_B0_P4_7 A15X_MUX('4',7,5)
#define PWM0_B1_P4_5 A15X_MUX('4',5,5)
#define PWM0_B2_P4_3 A15X_MUX('4',3,5)
#define PWM0_X0_P3_18 A15X_MUX('3',18,5)
#define PWM0_X1_P3_19 A15X_MUX('3',19,5)
#define PWM0_X2_P3_20 A15X_MUX('3',20,5)
#define PWM0_X3_P3_21 A15X_MUX('3',21,5)
#define PWM1_A0_P3_16 A15X_MUX('3',16,7)
#define PWM1_A3_P3_20 A15X_MUX('3',20,7)
#define PWM1_B0_P3_17 A15X_MUX('3',17,7)
#define PWM1_B3_P3_21 A15X_MUX('3',21,7)
#define PWM1_X0_P3_18 A15X_MUX('3',18,7)
#define PWM1_X1_P3_19 A15X_MUX('3',19,7)
#define PWM1_X2_P3_22 A15X_MUX('3',22,7)
#define SMARTDMA_PIO10_P0_20 A15X_MUX('0',20,7)
#define SMARTDMA_PIO10_P1_14 A15X_MUX('1',14,7)
#define SMARTDMA_PIO11_P0_21 A15X_MUX('0',21,7)
#define SMARTDMA_PIO11_P1_15 A15X_MUX('1',15,7)
#define SMARTDMA_PIO12_P0_22 A15X_MUX('0',22,7)
#define SMARTDMA_PIO13_P0_23 A15X_MUX('0',23,7)
#define SMARTDMA_PIO14_P2_10 A15X_MUX('2',10,7)
#define SMARTDMA_PIO15_P2_11 A15X_MUX('2',11,7)
#define SMARTDMA_PIO16_P3_16 A15X_MUX('3',16,10)
#define SMARTDMA_PIO17_P3_17 A15X_MUX('3',17,10)
#define SMARTDMA_PIO18_P3_18 A15X_MUX('3',18,10)
#define SMARTDMA_PIO19_P3_19 A15X_MUX('3',19,10)
#define SMARTDMA_PIO20_P3_20 A15X_MUX('3',20,10)
#define SMARTDMA_PIO21_P3_21 A15X_MUX('3',21,10)
#define SMARTDMA_PIO22_P2_20 A15X_MUX('2',20,7)
#define SMARTDMA_PIO22_P3_22 A15X_MUX('3',22,10)
#define SMARTDMA_PIO22_P4_2 A15X_MUX('4',2,7)
#define SMARTDMA_PIO23_P2_21 A15X_MUX('2',21,7)
#define SMARTDMA_PIO23_P4_3 A15X_MUX('4',3,7)
#define SMARTDMA_PIO24_P4_4 A15X_MUX('4',4,7)
#define SMARTDMA_PIO25_P4_5 A15X_MUX('4',5,7)
#define SMARTDMA_PIO26_P4_6 A15X_MUX('4',6,7)
#define SMARTDMA_PIO27_P4_7 A15X_MUX('4',7,7)
#define SMARTDMA_PIO4_P0_14 A15X_MUX('0',14,7)
#define SMARTDMA_PIO5_P0_15 A15X_MUX('0',15,7)
#define SMARTDMA_PIO8_P0_18 A15X_MUX('0',18,7)
#define SMARTDMA_PIO9_P0_19 A15X_MUX('0',19,7)
#define TRIG_IN4_P2_11 A15X_MUX('2',11,1)
#define TRIG_IN4_P4_6 A15X_MUX('4',6,1)
#define TRIG_IN5_P2_26 A15X_MUX('2',26,1)
#define TRIG_IN5_P4_7 A15X_MUX('4',7,1)
#define TRIG_IN8_P2_20 A15X_MUX('2',20,1)
#define TRIG_IN9_P2_21 A15X_MUX('2',21,1)
#define TRIG_OUT0_P3_20 A15X_MUX('3',20,1)
#define TRIG_OUT1_P3_21 A15X_MUX('3',21,1)
#define TRIG_OUT3_P4_5 A15X_MUX('4',5,1)
#define TRIG_OUT5_P2_10 A15X_MUX('2',10,1)
#define TRIG_OUT5_P2_23 A15X_MUX('2',23,1)
#define TRIG_OUT6_P2_24 A15X_MUX('2',24,1)
#define TRIG_OUT7_P2_25 A15X_MUX('2',25,1)
#define UTICK_CAP0_P0_14 A15X_MUX('0',14,5)
#define UTICK_CAP1_P0_15 A15X_MUX('0',15,5)
#define WUU0_IN13_P1_15 A15X_MUX('1',15,0)
#define WUU0_IN16_P4_2 A15X_MUX('4',2,0)
#define WUU0_IN17_P4_4 A15X_MUX('4',4,0)
#define WUU0_IN3_P0_19 A15X_MUX('0',19,0)
#define WUU0_IN4_P0_20 A15X_MUX('0',20,0)
#define WUU0_IN5_P0_23 A15X_MUX('0',23,0)

#endif /* _ZEPHYR_DTS_BINDING_MCXA174VLL_WRAPPER_ */
